# Halftone Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..Halftone Property
OverrideGraphicSettings Class See Also
---
Value of the halftone override.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool Halftone { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Halftone As Boolean
	Get
```

Visual C++
---
```text
public:
property bool Halftone {
	bool get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace